锘棵禄驴<!--
/*****************************************************************************
                                   忙聴楼忙聹聼猫碌聞忙聳聶
*****************************************************************************/

var lunarInfo=new Array(
0x04bd8,0x04ae0,0x0a570,0x054d5,0x0d260,0x0d950,0x16554,0x056a0,0x09ad0,0x055d2,
0x04ae0,0x0a5b6,0x0a4d0,0x0d250,0x1d255,0x0b540,0x0d6a0,0x0ada2,0x095b0,0x14977,
0x04970,0x0a4b0,0x0b4b5,0x06a50,0x06d40,0x1ab54,0x02b60,0x09570,0x052f2,0x04970,
0x06566,0x0d4a0,0x0ea50,0x06e95,0x05ad0,0x02b60,0x186e3,0x092e0,0x1c8d7,0x0c950,
0x0d4a0,0x1d8a6,0x0b550,0x056a0,0x1a5b4,0x025d0,0x092d0,0x0d2b2,0x0a950,0x0b557,
0x06ca0,0x0b550,0x15355,0x04da0,0x0a5d0,0x14573,0x052d0,0x0a9a8,0x0e950,0x06aa0,
0x0aea6,0x0ab50,0x04b60,0x0aae4,0x0a570,0x05260,0x0f263,0x0d950,0x05b57,0x056a0,
0x096d0,0x04dd5,0x04ad0,0x0a4d0,0x0d4d4,0x0d250,0x0d558,0x0b540,0x0b5a0,0x195a6,
0x095b0,0x049b0,0x0a974,0x0a4b0,0x0b27a,0x06a50,0x06d40,0x0af46,0x0ab60,0x09570,
0x04af5,0x04970,0x064b0,0x074a3,0x0ea50,0x06b58,0x055c0,0x0ab60,0x096d5,0x092e0,
0x0c960,0x0d954,0x0d4a0,0x0da50,0x07552,0x056a0,0x0abb7,0x025d0,0x092d0,0x0cab5,
0x0a950,0x0b4a0,0x0baa4,0x0ad50,0x055d9,0x04ba0,0x0a5b0,0x15176,0x052b0,0x0a930,
0x07954,0x06aa0,0x0ad50,0x05b52,0x04b60,0x0a6e6,0x0a4e0,0x0d260,0x0ea65,0x0d530,
0x05aa0,0x076a3,0x096d0,0x04bd7,0x04ad0,0x0a4d0,0x1d0b6,0x0d250,0x0d520,0x0dd45,
0x0b5a0,0x056d0,0x055b2,0x049b0,0x0a577,0x0a4b0,0x0aa50,0x1b255,0x06d20,0x0ada0)

var solarMonth=new Array(31,28,31,30,31,30,31,31,30,31,30,31);
var Gan=new Array("莽聰虏","盲鹿聶","盲赂聶","盲赂聛","忙聢聤","氓路卤","氓潞職","猫戮聸","氓拢卢","莽聶赂");
var Zhi=new Array("氓颅聬","盲赂聭","氓炉聟","氓聧炉","猫戮掳","氓路鲁","氓聧聢","忙聹陋","莽聰鲁","茅聟聣","忙聢聦","盲潞楼");
var Animals=new Array("茅录聽","莽聣聸","猫聶聨","氓聟聰","茅戮聶","猫聸聡","茅漏卢","莽戮聤","莽聦麓","茅赂隆","莽聥聴","莽聦陋");
var solarTerm = new Array("氓掳聫氓炉聮","氓陇搂氓炉聮","莽芦聥忙聵楼","茅聸篓忙掳麓","忙聝聤猫聸掳","忙聵楼氓聢聠","忙赂聟忙聵聨","猫掳路茅聸篓","莽芦聥氓陇聫","氓掳聫忙禄隆","猫聤聮莽搂聧","氓陇聫猫聡鲁","氓掳聫忙職聭","氓陇搂忙職聭","莽芦聥莽搂聥","氓陇聞忙職聭","莽聶陆茅聹虏","莽搂聥氓聢聠","氓炉聮茅聹虏","茅聹聹茅聶聧","莽芦聥氓聠卢","氓掳聫茅聸陋","氓陇搂茅聸陋","氓聠卢猫聡鲁")
var sTermInfo = new Array(0,21208,42467,63836,85337,107014,128867,150921,173149,195551,218072,240693,263343,285989,308563,331033,353350,375494,397447,419210,440795,462224,483532,504758)
var nStr1 = new Array('忙聴楼','盲赂聙','盲潞聦','盲赂聣','氓聸聸','盲潞聰','氓聟颅','盲赂聝','氓聟芦','盲鹿聺','氓聧聛')
var nStr2 = new Array('氓聢聺','氓聧聛','氓禄驴','氓聧聟','氓聧聦')
var nStr3 = new Array(" ","盲赂聙","盲潞聦","盲赂聣","氓聸聸","盲潞聰","氓聟颅","盲赂聝","氓聟芦","盲鹿聺","氓聧聛","氓聧聛盲赂聙","氓聧聛盲潞聦")
var monthName = new Array("JAN","FEB","MAR","APR","MAY","JUN","JUL","AUG","SEP","OCT","NOV","DEC");

//氓聸陆氓聨聠猫聤聜忙聴楼 *猫隆篓莽陇潞忙聰戮氓聛聡忙聴楼
var sFtv = new Array(
"0101*氓聟聝忙聴娄",
//"0214 忙聝聟盲潞潞猫聤聜",
"0308 氓娄聡氓楼鲁猫聤聜",
"0312 忙陇聧忙聽聭猫聤聜 ",
"0401 忙聞職盲潞潞猫聤聜",
"0422 氓聹掳莽聬聝忙聴楼",
"0501 氓聤鲁氓聤篓猫聤聜",
//"0504 茅聺聮氓鹿麓猫聤聜",
//"0512 忙聤陇氓拢芦猫聤聜",
"0601 氓聞驴莽芦楼猫聤聜",
"0608 盲赂聳莽聲聦忙碌路忙麓聥忙聴楼",
"0928 忙聲聶氓赂聢猫聤聜 氓颅聰氓颅聬猫炉聻猫戮掳",
"1001*氓聸陆氓潞聠猫聤聜",
//"1006 猫聙聛盲潞潞猫聤聜",
"1024 猫聛聰氓聬聢氓聸陆忙聴楼")

/********** For testing purposes, in order to make the calendar display simple, expecially for viewing 猫戮虏忙颅路茅聳聫忙聹聢氓陇搂氓掳聫.
//氓聠聹氓聨聠猫聤聜忙聴楼 *猫隆篓莽陇潞忙聰戮氓聛聡忙聴楼
var lFtv = new Array(
"0101*氓录楼氓聥聮猫聫漏猫聬篓氓聹拢猫炉聻茫聙聛忙聵楼猫聤聜",
"0106 氓庐職氓聟聣盲陆聸氓聹拢猫炉聻",
"0109 氓赂聺茅聡聤氓陇漏氓掳聤氓聹拢猫炉聻",
"0115 氓聟聝氓庐碌猫聤聜",
"0208 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸氓聡潞氓庐露",
"0215 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸忙露聟忙搂聝",
"0219 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓氓聹拢猫炉聻",
"0221 忙聶庐猫麓陇猫聫漏猫聬篓氓聹拢猫炉聻",
"0316 氓聡聠忙聫聬猫聫漏猫聬篓氓聹拢猫炉聻",
"0404 忙聳聡忙庐聤猫聫漏猫聬篓氓聹拢猫炉聻",
"0408 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸氓聹拢猫炉聻",
"0415 盲陆聸氓聬聣莽楼楼忙聴楼芒聙聰芒聙聰茅聡聤猫驴娄莽聣聼氓掳录盲陆聸猫炉聻莽聰聼茫聙聛忙聢聬茅聛聯茫聙聛忙露聟忙搂聝盲赂聣忙聹聼氓聬聦盲赂聙氓潞聠(氓聧鲁氓聧聴盲录聽盲陆聸忙聲聶氓聸陆氓庐露莽職聞氓聧芦氓隆聻猫聤聜)",
"0428 猫聧炉莽聨聥猫聫漏猫聬篓氓聹拢猫炉聻",
"0505 莽芦炉氓聧聢猫聤聜",
"0513 盲录陆猫聯聺猫聫漏猫聬篓氓聹拢猫炉聻",
"0603 忙聤陇忙鲁聲茅聼娄茅漏庐氓掳聤氓陇漏猫聫漏猫聬篓氓聹拢猫炉聻",
"0619 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓忙聢聬茅聛聯",
//"0707 盲赂聝氓陇聲忙聝聟盲潞潞猫聤聜",
"0713 氓陇搂氓聤驴猫聡鲁猫聫漏猫聬篓氓聹拢猫炉聻",
"0715 盲陆聸忙卢垄氓聳聹忙聴楼茫聙聛盲赂颅氓聟聝猫聤聜",
"0721 忙聶庐氓庐聣莽楼聳氓赂聢氓聹拢猫炉聻",
"0724 茅戮聶忙聽聭猫聫漏猫聬篓氓聹拢猫炉聻",
"0730 氓聹掳猫聴聫莽聨聥猫聫漏猫聬篓氓聹拢猫炉聻",
"0815 盲赂颅莽搂聥猫聤聜",
"0822 莽聡聝莽聛炉氓聫陇盲陆聸氓聹拢猫炉聻",
"0909 茅聡聧茅聵鲁猫聤聜",
"0919 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓氓聡潞氓庐露",
"0930 猫聧炉氓赂聢莽聬聣莽聮聝氓聟聣氓娄聜忙聺楼氓聹拢猫炉聻",
"1005 猫戮戮忙聭漏莽楼聳氓赂聢氓聹拢猫炉聻",
"1025 氓庐聴氓聮炉氓路麓忙露聟莽聸聵",
"1117 茅聵驴氓录楼茅聶聙盲陆聸氓聹拢猫炉聻",
"1208 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸忙聢聬茅聛聯茫聙聛猫聟聤氓聟芦猫聤聜",
"1224 氓掳聫氓鹿麓",
"1229 氓聧聨盲赂楼猫聫漏猫聬篓氓聹拢猫炉聻",
"0100*茅聶陇氓陇聲")
**********/

//氓聠聹氓聨聠猫聤聜忙聴楼 *猫隆篓莽陇潞忙聰戮氓聛聡忙聴楼
var lFtv = new Array(
"0101 忙聵楼猫聤聜茂录聦忙聹卢忙聹聢盲赂潞忙聳聥忙聹聢茂录聛氓录楼氓聥聮猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦氓陇漏猫聟聤茂录聦莽聨聣氓赂聺忙聽隆盲赂聳盲潞潞莽楼聻忙掳聰莽娄聞氓聭陆茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0103 盲赂聡莽楼聻茅聝陆盲录職茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0105 盲潞聰猫聶職氓驴聦",
"0106 氓庐職氓聟聣盲陆聸氓聹拢猫炉聻茂录聦氓聫聢氓聟颅猫聙聴氓驴聦茂录聦氓聫聢茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0107 盲赂聤盲录職忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴",
"0108 猫搂聜茅聼鲁忙聳聥茂录聦氓聫聢盲潞聰忙庐驴茅聵聨莽陆聴氓陇漏氓颅聬猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0109 氓赂聺茅聡聤氓陇漏氓掳聤茂录聢莽聨聣莽職聡氓陇搂氓赂聺茂录聣氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0112 氓聡聙氓庐聴盲赂聝莽楼聳莽聹聛氓赂赂忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"0113 忙聺篓氓聟卢氓驴聦",
"0114 盲赂聣氓聟聝茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0115 氓聟聝氓庐碌猫聤聜茂录聦盲赂聣氓聟聝茅聶聧莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聫聢盲赂聤氓聟聝莽楼聻盲录職茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0116 盲赂聣氓聟聝茅聶聧莽聤炉猫聙聟氓聡聫氓炉驴",
"0118 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0119 茅聲驴忙聵楼莽聹聼盲潞潞猫炉聻",
"0121 氓聡聙氓庐聴盲鹿聺莽楼聳猫聲聟莽聸聤忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"0123 盲赂聣氓掳赂莽楼聻氓楼聫盲潞聥茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0124 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0125 忙聹聢忙聶娄忙聴楼莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聫聢氓陇漏氓聹掳盲禄聯氓录聙忙聴楼莽聤炉猫聙聟忙聧聼氓炉驴茂录聦氓颅聬氓赂娄莽聳戮",
"0127 忙聳聴茅聶聧莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0128 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0129 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0130 忙聹聢忙聶娄茫聙聛氓聫赂氓聭陆氓楼聫盲潞聥莽聤炉猫聙聟氓聡聫氓炉驴茂录聢氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聣茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0201 氓聹掳猫聴聫忙聳聥茂录聦盲赂聙忙庐驴莽搂娄氓鹿驴莽聨聥猫炉聻茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0202 盲赂聡莽楼聻茅聝陆盲录職茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦莽娄聫氓戮路氓聹聼氓聹掳忙颅拢莽楼聻猫炉聻茂录聦莽聤炉猫聙聟氓戮聴莽楼赂",
"0203 忙聳聡忙聵聦氓赂聺氓聬聸猫炉聻猫戮掳莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦忙聳聴茅聶聧莽聤炉猫聙聟氓陇潞莽潞陋",
"0206 盲赂聹氓聧聨氓赂聺氓聬聸猫炉聻茂录聦茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0207 猫搂聜茅聼鲁忙聳聥",
"0208 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸氓聡潞氓庐露茂录聦盲赂聣忙庐驴氓庐聥氓赂聺莽聨聥猫炉聻茂录聦氓录聽氓陇搂氓赂聺猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0209 氓聟颅莽楼聳忙聟搂猫聝陆氓聹拢猫炉聻茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥",
"0211 忙聺篓氓聟卢氓驴聦",
"0214 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0215 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸忙露聟忙搂聝茂录聦氓陇陋盲赂聤猫聙聛氓聬聸猫炉聻茂录聦氓聫聢忙聹聢忙聹聸茂录聢氓聧鲁忙聹聢氓聧聤茂录聣茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0217 盲赂聹忙聳鹿忙聺聹氓掳聠氓聠聸猫炉聻",
"0218 氓聹掳猫聴聫忙聳聥茂录聦氓聸聸忙庐驴盲潞聰氓庐聵莽聨聥猫炉聻茂录聦猫聡鲁氓聹拢氓聟聢氓赂聢氓颅聰氓颅聬猫庐鲁猫戮掳茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0219 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥",
"0221 忙聶庐猫麓陇猫聫漏猫聬篓氓聹拢猫炉聻",
"0223 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0224 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0225 忙聹聢忙聶娄忙聴楼莽聤炉猫聙聟氓聡聫氓炉驴",
"0226 氓聡聙氓庐聴氓聟颅莽楼聳忙掳赂忙聵聨忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"0227 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0228 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0229 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0230 忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0301 氓聹掳猫聴聫忙聳聥茂录聦盲潞聦忙庐驴忙楼職忙卤聼莽聨聥猫炉聻茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0303 猫搂聜茅聼鲁忙聳聥茂录聦莽聨聞氓陇漏盲赂聤氓赂聺猫炉聻茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0306 猫搂聜茅聼鲁忙聳聥茂录聦茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0308 氓聟颅忙庐驴氓聧聻氓聼聨莽聨聥猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0309 莽聣聸茅卢录莽楼聻氓聡潞茂录聦莽聤炉猫聙聟盲潞搂忙聛露猫聝聨茂录聦忙聺篓氓聟卢氓驴聦",
"0312 盲赂颅氓陇庐忙颅拢茅聛聯猫炉聻",
"0313 猫搂聜茅聼鲁忙聳聥",
"0314 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0315 忙聵聤氓陇漏盲赂聤氓赂聺猫炉聻茂录聦莽聨聞氓聺聸猫炉聻茂录聦氓聫聢忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0316 氓聡聠忙聫聬猫聫漏猫聬篓氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0318 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0319 盲赂颅氓虏鲁氓陇搂氓赂聺猫炉聻茂录聦氓聬聨氓聹聼氓篓聵氓篓聵猫炉聻茂录聦盲赂聣猫聦聟茅聶聧",
"0320 氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴茂录聦氓颅聬氓颅聶氓篓聵氓篓聵猫炉聻",
"0323 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0324 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0325 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0327 盲赂聝忙庐驴忙鲁掳氓卤卤莽聨聥猫炉聻茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0328 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦猫聥聧茅垄聣猫聡鲁氓聹拢氓聟聢氓赂聢猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦盲赂聹氓虏鲁氓陇搂氓赂聺猫炉聻茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0329 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0330 忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0401 氓聹掳猫聴聫忙聳聥茂录聦氓聟芦忙庐驴茅聝陆氓赂聜莽聨聥猫炉聻茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0403 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0404 忙聳聡忙庐聤猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聫聢盲赂聡莽楼聻氓聳聞盲录職茂录聦莽聤炉猫聙聟氓陇卤莽聵录氓陇颅猫聝聨",
"0406 茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0407 氓聧聴忙聳聴茫聙聛氓聦聴忙聳聴茫聙聛猫楼驴忙聳聴氓聬聦茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦忙聺篓氓聟卢氓驴聦",
"0408 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢盲赂聡莽楼聻氓聳聞盲录職茂录聦莽聤炉猫聙聟氓陇卤莽聵录氓陇颅猫聝聨茂录聦氓聳聞忙聛露莽芦楼氓颅聬茅聶聧茂录聦莽聤炉猫聙聟猫隆聙忙颅禄茂录聦盲鹿聺忙庐驴氓鹿鲁莽颅聣莽聨聥猫炉聻茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0414 氓聡聙氓庐聴氓聧聛盲赂聙莽楼聳莽聹聛氓潞碌忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦莽潞炉茅聵鲁莽楼聳氓赂聢猫炉聻茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0415 忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦茅聮聼莽娄禄莽楼聳氓赂聢猫炉聻茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0416 氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴",
"0417 氓聧聛忙庐驴猫陆卢猫陆庐莽聨聥猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0418 氓聹掳猫聴聫忙聳聥茂录聦氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦莽麓芦氓戮庐氓陇搂氓赂聺猫炉聻茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0420 莽聹录氓聟聣氓聹拢忙炉聧猫炉聻",
"0422 猫搂聜茅聼鲁忙聳聥",
"0423 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0424 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0425 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0427 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0428 猫聧炉莽聨聥猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0429 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0430 忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0501 忙聹卢忙聹聢盲赂潞忙聳聥忙聹聢茂录聛氓聹掳猫聴聫忙聳聥茂录聦氓聧聴忙聻聛茅聲驴莽聰聼氓陇搂氓赂聺猫炉聻茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0503 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥",
"0505 莽芦炉氓聧聢猫聤聜茂录聦氓聹掳猫聟聤茂录聦盲潞聰氓赂聺忙聽隆氓庐職莽聰聼盲潞潞氓庐聵莽聢碌茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥",
"0506 盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥茂录聦茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0507 盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥",
"0508 氓聧聴忙聳鹿盲潞聰茅聛聯猫炉聻茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0511 氓陇漏盲禄聯氓录聙忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴茂录聦氓陇漏盲赂聥茅聝陆氓聼聨茅職聧猫炉聻",
"0512 莽聜鲁莽聛碌氓聟卢猫炉聻",
"0513 盲录陆猫聯聺猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聟鲁氓聹拢茅聶聧茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋",
"0514 氓陇聹氓颅聬忙聴露盲赂潞氓陇漏氓聹掳盲潞陇忙鲁掳茂录聦莽聤炉猫聙聟盲赂聣氓鹿麓氓聠聟氓陇芦氓娄聡盲驴卤盲潞隆茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0515 忙聹聢忙聹聸茂录聦盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0516 盲鹿聺忙炉聮忙聴楼茂录聦氓陇漏氓聹掳氓聟聝忙掳聰茅聙聽氓聦聳盲赂聡莽聣漏盲鹿聥猫戮掳茂录聦莽聤炉猫聙聟盲赂聣氓鹿麓氓聠聟氓陇芦氓娄聡盲驴卤盲潞隆",
"0517 猫搂聜茅聼鲁忙聳聥茂录聦盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥",
"0518 氓聹掳猫聴聫忙聳聥茂录聦氓录聽氓陇漏氓赂聢猫炉聻茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0522 氓颅聺氓篓楼莽楼聻猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0523 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0524 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0525 盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥茂录聦忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0526 盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥",
"0527 盲鹿聺忙炉聮忙聴楼茂录聦莽聤炉猫聙聟氓陇颅盲潞隆茂录聦氓楼聡莽楼赂盲赂聧忙碌聥茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0528 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0529 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0530 忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0601 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0603 茅聼娄茅漏庐猫聫漏猫聬篓氓聹拢猫炉聻茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙聺篓氓聟卢氓驴聦",
"0605 氓聧聴猫碌隆茅聝篓忙麓虏猫陆卢氓陇搂忙鲁聲猫陆庐茂录聦莽聤炉猫聙聟忙聧聼氓炉驴",
"0606 氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴",
"0608 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0610 茅聡聭莽虏聼氓娄聜忙聺楼猫炉聻",
"0614 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0615 忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0616 猫搂聜茅聼鲁忙聳聥",
"0618 猫搂聜茅聼鲁忙聳聥茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0619 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓忙聢聬茅聛聯茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0623 猫搂聜茅聼鲁忙聳聥茂录聦氓聧聴忙聳鹿莽聛芦莽楼聻猫炉聻茂录聦莽聤炉猫聙聟茅聛颅氓聸聻莽娄聞茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0624 氓聹掳猫聴聫忙聳聥茂录聦茅聸路莽楼聳猫炉聻茂录聦氓聟鲁氓赂聺猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0625 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0627 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0628 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0629 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0630 忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0701 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙聺篓氓聟卢氓驴聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0702 氓聡聙氓庐聴氓聟芦莽楼聳猫聨虏忙卤聽忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"0703 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0705 盲赂颅盲录職忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴茂录聦盲赂聙盲陆聹氓聢聺盲赂聝",
"0706 茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0707 茅聛聯氓戮路猫聟聤茂录聦盲潞聰氓赂聺忙聽隆莽聰聼盲潞潞氓聳聞忙聛露茂录聦茅颅聛忙聵聼猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋",
"0708 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0709 氓聡聙氓庐聴氓聧聛莽楼聳忙聢陋忙碌聛忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"0710 茅聵麓忙炉聮忙聴楼",
"0712 茅聲驴莽聹聼猫掳颅莽聹聼盲潞潞猫炉聻",
"0713 氓陇搂氓聤驴猫聡鲁猫聫漏猫聬篓氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥",
"0714 盲赂聣氓聟聝茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0715 盲陆聸忙卢垄氓聳聹忙聴楼茂录聦氓聫聢忙聹聢忙聹聸茂录聦盲赂聣氓聟聝茅聶聧茂录聦氓聹掳氓庐聵忙聽隆莽卤聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0716 盲赂聣氓聟聝茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0718 氓聹掳猫聴聫忙聳聥茂录聦猫楼驴莽聨聥忙炉聧猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0719 氓聡聙氓庐聴盲赂聣莽楼聳忙聣驴猫驴聹忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦氓陇陋氓虏聛猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0721 忙聶庐氓潞碌莽楼聳氓赂聢氓聹拢猫炉聻",
"0722 氓垄聻莽娄聫猫麓垄莽楼聻猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋",
"0723 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0724 茅戮聶忙聽聭猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0725 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0727 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0728 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0729 忙聺篓氓聟卢氓驴聦茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0730 氓聹掳猫聴聫莽聨聥猫聫漏猫聬篓氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0801 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦猫庐赂莽聹聼氓聬聸猫炉聻茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0803 忙聳聴茅聶聧茂录聦氓聦聴忙聳聴猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫赂氓聭陆莽聛露氓聬聸猫炉聻茂录聦莽聤炉猫聙聟茅聛颅氓聸聻莽娄聞",
"0805 茅聸路氓拢掳氓陇搂氓赂聺猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0806 氓聡聙氓庐聴氓聢聺莽楼聳忙聟搂猫驴聹忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0808 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0810 氓聦聴忙聳聴氓陇搂氓赂聺猫炉聻",
"0812 猫楼驴忙聳鹿盲潞聰茅聛聯猫炉聻",
"0814 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0815*盲赂颅莽搂聥猫聤聜茂录聦猫庐掳氓戮聴忙聦聛忙聳聥猫炉碌忙聢聮茂录聛氓聫聢忙聹聢忙聹聸茂录聦氓陇陋忙聵聨忙聹聺氓聟聝茂录聦莽聤炉猫聙聟忙職麓盲潞隆茂录聦氓庐聹莽聞職茅娄聶氓庐聢氓陇聹茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0816 猫搂聜茅聼鲁忙聳聥茂录聦氓陇漏忙聸鹿忙聨聽氓聢路莽聹聼氓聬聸茅聶聧茂录聦莽聤炉猫聙聟猫麓芦氓陇颅",
"0818 氓聹掳猫聴聫忙聳聥茂录聦氓陇漏盲潞潞氓聟麓莽娄聫盲鹿聥猫戮掳茂录聦氓庐聹忙聳聥忙聢聮茂录聦氓颅聵忙聝鲁氓聬聣盲潞聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0822 莽聡聝莽聛炉氓聫陇盲陆聸氓聹拢猫炉聻",
"0823 忙卤聣忙聛聮氓聙聶氓录聽忙聵戮莽聨聥猫炉聻茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0824 氓聹掳猫聴聫忙聳聥茂录聦莽聛露氓聬聸氓陇芦盲潞潞猫炉聻茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0825 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"0827 忙聳聴茅聶聧茂录聦猫聡鲁氓聹拢氓聟聢氓赂聢氓颅聰氓颅聬猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙聺篓氓聟卢氓驴聦茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0828 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聸聸氓陇漏盲录職盲潞聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0829 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0830 猫炉赂莽楼聻猫聙聝忙聽隆茂录聦莽聤炉猫聙聟氓陇潞莽庐聴茂录聦忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0901 忙聹卢忙聹聢盲赂潞忙聳聥忙聹聢茂录聛氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聧聴忙聳聴猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0902 氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0903 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦盲潞聰莽聵聼莽楼聻猫炉聻茂录聦氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0904 氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0905 氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0906 茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0907 氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0908 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0909 茅聡聧茅聵鲁猫聤聜茂录聦忙聳聴忙炉聧猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋茂录聦茅聟聠茅聝陆氓陇搂氓赂聺猫炉聻茂录聦莽聨聞氓陇漏盲赂聤氓赂聺茅拢聻氓聧聡茂录聦氓聦聴忙聳聴盲鹿聺忙聵聼茅聶聧盲赂聳茂录聢猫聡陋氓聢聺盲赂聙猫聡鲁氓聢聺盲鹿聺茂录聣茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦忙颅陇盲鹿聺忙聴楼盲驴卤氓庐聹忙聳聥忙聢聮",
"0910 忙聳聴忙炉聧茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"0911 氓庐聹忙聢聮",
"0913 氓颅聼氓漏聠氓掳聤莽楼聻猫炉聻",
"0914 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0915 忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0917 茅聡聭茅戮聶氓聸聸氓陇搂莽聨聥猫炉聻茂录聦莽聤炉猫聙聟茅聛颅忙掳麓氓聨聞",
"0918 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0919 猫搂聜盲赂聳茅聼鲁猫聫漏猫聬篓氓聡潞氓庐露茂录聦忙聴楼氓庐芦忙聹聢氓庐芦盲录職氓聬聢茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聫聢猫搂聜茅聼鲁忙聳聥",
"0923 猫搂聜茅聼鲁忙聳聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0924 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0925 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦忙聺篓氓聟卢氓驴聦",
"0927 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"0928 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0929 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0930 猫聧炉氓赂聢盲陆聸氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓聧卤莽聳戮茂录聦忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1001 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦忙掳聭氓虏聛猫聟聤茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥茅聶聧茂录聦莽聤炉猫聙聟盲赂聙氓鹿麓氓聠聟忙颅禄茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1002 猫搂聜茅聼鲁忙聳聥",
"1003 氓聡聙氓庐聴盲潞聰莽楼聳氓掳聭氓潞路忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦盲赂聣猫聦聟猫炉聻",
"1005 猫戮戮忙聭漏莽楼聳氓赂聢猫炉聻猫戮掳茂录聦盲赂聥盲录職忙聴楼茂录聦莽聤炉猫聙聟忙聧聼氓炉驴",
"1006 茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓陇漏忙聸鹿猫聙聝氓炉聼茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"1008 氓陇搂氓驴聦猫聣虏忙卢虏茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1010 氓聸聸氓陇漏莽聨聥茅聶聧茂录聦莽聤炉猫聙聟盲赂聙氓鹿麓氓聠聟忙颅禄",
"1011 氓庐聹忙聢聮",
"1014 盲赂聣氓聟聝茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1015 忙聹聢忙聹聸茂录聦盲赂聣氓聟聝茅聶聧茂录聦盲赂聥氓聟聝忙掳麓氓潞聹忙聽隆莽卤聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1016 盲赂聣氓聟聝茅聶聧茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"1018 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1023 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦忙聺篓氓聟卢氓驴聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1024 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1025 忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"1027 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聦聴忙聻聛莽麓芦氓戮庐氓陇搂氓赂聺茅聶聧茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"1028 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮 茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1029 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1030 猫聧炉氓赂聢盲陆聸氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓聧卤莽聳戮茂录聦忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1101 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1103 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"1104 氓聡聙氓庐聴氓聧聛盲赂聣莽楼聳氓聧掳氓聟聣忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦氓聫聢猫聡鲁氓聹拢氓聟聢氓赂聢氓颅聰氓颅聬猫炉聻茂录聦莽聤炉猫聙聟氓聣聤莽娄聞氓陇潞莽潞陋",
"1106 茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦猫楼驴氓虏鲁氓陇搂氓赂聺猫炉聻",
"1108 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1111 氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦氓陇陋盲鹿聶忙聲聭猫聥娄氓陇漏氓掳聤猫炉聻茂录聦莽聤炉猫聙聟氓陇潞莽潞陋",
"1114 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1115 忙聹聢忙聹聸茂录聦盲赂聤氓聧聤氓陇聹莽聤炉莽聰路忙颅禄盲赂聥氓聧聤氓陇聹莽聤炉氓楼鲁忙颅禄茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1117 茅聵驴氓录楼茅聶聙盲陆聸氓聹拢猫炉聻茂录聦氓聫聢氓聡聙氓庐聴盲潞聦莽楼聳氓聳聞氓炉录忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"1118 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1119 猫搂聜茅聼鲁忙聳聥茂录聦氓陇陋茅聵鲁忙聴楼氓庐芦猫炉聻茂录聦莽聤炉猫聙聟氓戮聴氓楼聡莽楼赂",
"1121 忙聺篓氓聟卢氓驴聦",
"1123 氓录聽盲禄聶猫炉聻茂录聦莽聤炉猫聙聟莽禄聺氓聴拢茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1124 猫搂聜茅聼鲁忙聳聥茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1125 忙聨聽氓聢路氓陇搂氓陇芦茅聶聧茂录聦莽聤炉猫聙聟茅聛颅氓陇搂氓聡露茂录聦忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"1126 氓聦聴忙聳鹿盲潞聰茅聛聯猫炉聻",
"1127 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"1128 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1129 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1130 猫聧炉氓赂聢盲陆聸氓聹拢猫炉聻茂录聦莽聤炉猫聙聟氓聧卤莽聳戮茂录聦忙聹聢忙聶娄茂录聦氓聫赂氓聭陆氓楼聫盲潞聥茂录聦氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦莽聤炉猫聙聟氓聡聫氓炉驴茂录聦氓娄聜忙聹聢氓掳聫茂录聦氓聧鲁忙聢聮氓禄驴盲鹿聺茂录聢忙炉聫忙聹聢氓聬聦茂录聣茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1201 氓聡聙氓庐聴氓聸聸莽楼聳忙鲁聲莽聟搂忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼茂录聦氓聫聢氓聹掳猫聴聫忙聳聥茂录聦氓聫聢忙聹聢忙聹聰茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1203 忙聳聴茅聶聧莽聤炉猫聙聟氓陇潞莽潞陋",
"1206 氓陇漏氓聹掳盲禄聯氓录聙忙聴楼茂录聦氓聫聢茅聸路忙聳聥忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"1207 忙聨聽氓聢路氓陇搂氓陇芦茅聶聧茂录聦莽聤炉猫聙聟氓戮聴忙聛露莽聳戮",
"1208 茅聡聤猫驴娄莽聣聼氓掳录盲陆聸忙聢聬茅聛聯茂录聦猫聟聤氓聟芦猫聤聜茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聢聺忙聴卢氓聠聟忙聢聤忙聴楼茂录聦盲潞娄氓聬聧莽聨聥盲戮炉猫聟聤茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1212 氓陇陋莽麓聽盲赂聣氓聟聝氓聬聸忙聹聺莽聹聼",
"1214 氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1215 忙聹聢忙聹聸茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1216 氓聧聴氓虏鲁氓陇搂氓赂聺猫炉聻",
"1217 氓聡聙氓庐聴氓聧聛盲潞聦莽楼聳氓陆禄忙聜聼忙鲁聲氓赂聢氓聹聠氓炉聜忙聴楼",
"1218 氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1219 忙聺篓氓聟卢氓驴聦",
"1220 氓陇漏氓聹掳盲潞陇茅聛聯茂录聦莽聤炉猫聙聟盲驴聝氓炉驴",
"1221 氓陇漏莽聦路盲赂聤氓赂聺猫炉聻",
"1223 盲潞聰氓虏鲁猫炉聻茅聶聧茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢莽聛露氓聬聸猫聤聜茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1224 氓掳聫氓鹿麓茂录聦氓聹掳猫聴聫忙聳聥茂录聦氓聫聢氓聫赂氓聭陆忙聹聺氓陇漏氓楼聫盲潞潞氓聳聞忙聛露茂录聦莽聤炉猫聙聟氓戮聴氓陇搂莽楼赂茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1225 猫搂聜茅聼鲁忙聳聥茂录聦盲赂聣忙赂聟莽聨聣氓赂聺氓聬聦茅聶聧茂录聦猫聙聝氓炉聼氓聳聞忙聛露茂录聦莽聤炉猫聙聟氓戮聴氓楼聡莽楼赂茂录聦氓聫聢忙聹聢忙聶娄忙聴楼茂录聦莽聤炉猫聙聟氓聡聫氓炉驴",
"1227 忙聳聴茅聶聧茂录聦莽聤炉猫聙聟氓陇潞莽潞陋茂录聦氓聫聢猫聥楼忙聹聢氓掳聫氓聢聶忙聹卢忙聴楼盲赂潞氓聧聛忙聳聥忙聴楼",
"1228 氓聹掳猫聴聫忙聳聥茂录聦盲潞潞莽楼聻氓聹篓茅聵麓茂录聦莽聤炉猫聙聟氓戮聴莽聴聟茂录聦氓庐聹氓聟聢盲赂聙忙聴楼氓聧鲁忙聢聮茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"1229 氓聧聨盲赂楼猫聫漏猫聬篓氓聹拢猫炉聻茂录聦氓聫聢氓聸聸氓陇漏莽聨聥氓路隆猫隆聦茂录聦氓聫聢氓聧聛忙聳聥忙聴楼",
"0100*茅聶陇氓陇聲茂录聦猫庐掳氓戮聴忙聦聛忙聳聥猫炉碌忙聢聮茂录聛猫炉赂莽楼聻盲赂聥茅聶聧茂录聦氓炉聼猫庐驴氓聳聞忙聛露茂录聦莽聤炉猫聙聟莽聰路氓楼鲁盲驴卤盲潞隆茂录聦氓聫聢氓聧聛忙聳聥忙聴楼")

//忙聼聬忙聹聢莽職聞莽卢卢氓聡聽盲赂陋忙聵聼忙聹聼氓聡聽
var wFtv = new Array(
"0520 忙炉聧盲潞虏猫聤聜")

/*****************************************************************************
                                      忙聴楼忙聹聼猫庐隆莽庐聴
*****************************************************************************/

//====================================== 盲录聽氓聸聻氓聠聹氓聨聠 y氓鹿麓莽職聞忙聙禄氓陇漏忙聲掳
function lYearDays(y) {
   var i, sum = 348
   for(i=0x8000; i>0x8; i>>=1) sum += (lunarInfo[y-1900] & i)? 1: 0
   return(sum+leapDays(y))
}

//====================================== 盲录聽氓聸聻氓聠聹氓聨聠 y氓鹿麓茅聴掳忙聹聢莽職聞氓陇漏忙聲掳
function leapDays(y) {
   if(leapMonth(y))  return((lunarInfo[y-1900] & 0x10000)? 30: 29)
   else return(0)
}

//====================================== 盲录聽氓聸聻氓聠聹氓聨聠 y氓鹿麓茅聴掳氓聯陋盲赂陋忙聹聢 1-12 , 忙虏隆茅聴掳盲录聽氓聸聻 0
function leapMonth(y) {
   return(lunarInfo[y-1900] & 0xf)
}

//====================================== 盲录聽氓聸聻氓聠聹氓聨聠 y氓鹿麓m忙聹聢莽職聞忙聙禄氓陇漏忙聲掳
function monthDays(y,m) {
   return( (lunarInfo[y-1900] & (0x10000>>m))? 30: 29 )
}

//====================================== 莽庐聴氓聡潞氓聠聹氓聨聠, 盲录聽氓聟楼忙聴楼忙聹聼莽聣漏盲禄露, 盲录聽氓聸聻氓聠聹氓聨聠忙聴楼忙聹聼莽聣漏盲禄露
//                                       猫炉楼莽聣漏盲禄露氓卤聻忙聙搂忙聹聣 .year .month .day .isLeap .yearCyl .dayCyl .monCyl
function Lunar(objDate) {

   var i, leap=0, temp=0
   var baseDate = new Date(1900,0,31)
//   var offset   = (objDate - baseDate)/86400000 //氓聹篓忙聼聬盲潞聸忙聯聧盲陆聹莽鲁禄莽碌卤盲赂聥氓聝聟茅隆炉莽陇潞茅聝篓盲禄陆忙聹聢盲禄陆
   var offset   = (Date.UTC(objDate.getFullYear(),objDate.getMonth(),objDate.getDate()) - Date.UTC(1900,0,31))/86400000; //忙聢聨氓聛楼氓聟聢莽聰聼

   this.dayCyl = offset + 40
   this.monCyl = 14

   for(i=1900; i<2050 && offset>0; i++) {
      temp = lYearDays(i)
      offset -= temp
      this.monCyl += 12
   }

   if(offset<0) {
      offset += temp;
      i--;
      this.monCyl -= 12
   }

   this.year = i
   this.yearCyl = i-1864

   leap = leapMonth(i) //茅聴掳氓聯陋盲赂陋忙聹聢
   this.isLeap = false

   for(i=1; i<13 && offset>0; i++) {
      //茅聴掳忙聹聢
      if(leap>0 && i==(leap+1) && this.isLeap==false)
         { --i; this.isLeap = true; temp = leapDays(this.year); }
      else
         { temp = monthDays(this.year, i); }

      //猫搂拢茅聶陇茅聴掳忙聹聢
      if(this.isLeap==true && i==(leap+1)) this.isLeap = false

      offset -= temp
      if(this.isLeap == false) this.monCyl ++
   }

   if(offset==0 && leap>0 && i==leap+1)
      if(this.isLeap)
         { this.isLeap = false; }
      else
         { this.isLeap = true; --i; --this.monCyl;}

   if(offset<0){ offset += temp; --i; --this.monCyl; }

   this.month = i
   this.day = offset + 1
   
}

//==============================盲录聽氓聸聻氓聸陆氓聨聠 y氓鹿麓忙聼聬m+1忙聹聢莽職聞氓陇漏忙聲掳
function solarDays(y,m) {
   if(m==1)
      return(((y%4 == 0) && (y%100 != 0) || (y%400 == 0))? 29: 28)
   else
      return(solarMonth[m])
}

//============================== 盲录聽氓聟楼 offset 盲录聽氓聸聻氓鹿虏忙聰炉, 0=莽聰虏氓颅聬
function cyclical(num) {
   return(Gan[num%10]+Zhi[num%12])
}

//============================== 忙聹聢氓聨聠氓卤聻忙聙搂
function calElement(sYear,sMonth,sDay,week,lYear,lMonth,lDay,isLeap,cYear,cMonth,cDay) {

      this.isToday    = false;
      //氓聸陆氓聨聠
      this.sYear      = sYear;
      this.sMonth     = sMonth;
      this.sDay       = sDay;
      this.week       = week;
      //氓聠聹氓聨聠
      this.lYear      = lYear;
      this.lMonth     = lMonth;
      this.lDay       = lDay;
      this.isLeap     = isLeap;
      //氓鹿虏忙聰炉
      this.cYear      = cYear;
      this.cMonth     = cMonth;
      this.cDay       = cDay;

      this.color      = '';

      this.lunarFestival = ''; //氓聠聹氓聨聠猫聤聜忙聴楼
      this.solarFestival = ''; //氓聸陆氓聨聠猫聤聜忙聴楼
      this.solarTerms    = ''; //猫聤聜忙掳聰

}

//===== 忙聼聬氓鹿麓莽職聞莽卢卢n盲赂陋猫聤聜忙掳聰盲赂潞氓聡聽忙聴楼(盲禄聨0氓掳聫氓炉聮猫碌路莽庐聴)
function sTerm(y,n) {
   var offDate = new Date( ( 31556925974.7*(y-1900) + sTermInfo[n]*60000  ) + Date.UTC(1900,0,6,2,5) )
   return(offDate.getUTCDate())
}

//============================== 盲录聽氓聸聻忙聹聢氓聨聠莽聣漏盲禄露 (y氓鹿麓,m+1忙聹聢)
function calendar(y,m) {

   var sDObj, lDObj, lY, lM, lD=1, lL, lX=0, tmp1, tmp2
   var lDPOS = new Array(3)
   var lDPOSleap = new Array(3) //modified by mengxw,猫庐掳氓陆聲氓聠聹氓聨聠茅聴掳忙聹聢茫聙聜
   var n = 0
   var firstLM = 0

   sDObj = new Date(y,m,1)				//氓陆聯忙聹聢盲赂聙忙聴楼忙聴楼忙聹聼

   this.length    = solarDays(y,m)		//氓聸陆氓聨聠氓陆聯忙聹聢氓陇漏忙聲掳
   this.firstWeek = sDObj.getDay()		//氓聸陆氓聨聠氓陆聯忙聹聢1忙聴楼忙聵聼忙聹聼氓聡聽

   for(var i=0;i<3;i++) lDPOSleap[i]=0	//modified by mengxw,氓聠聹氓聨聠茅聴掳忙聹聢氓聢聺氓搂聥氓聦聳茫聙聜
   for(var i=0;i<this.length;i++) {

      if(lD>lX) {
         sDObj = new Date(y,m,i+1)		//氓陆聯忙聹聢盲赂聙忙聴楼忙聴楼忙聹聼
         lDObj = new Lunar(sDObj)		//氓聠聹氓聨聠
         lY    = lDObj.year				//氓聠聹氓聨聠氓鹿麓
         lM    = lDObj.month			//氓聠聹氓聨聠忙聹聢
         lD    = lDObj.day				//氓聠聹氓聨聠忙聴楼
         lL    = lDObj.isLeap			//氓聠聹氓聨聠忙聵炉氓聬娄茅聴掳忙聹聢
         lX    = lL? leapDays(lY): monthDays(lY,lM) //氓聠聹氓聨聠氓陆聯忙聹聢忙聹聙氓聬聨盲赂聙氓陇漏

         if(n==0) firstLM = lM
         lDPOS[n++] = i-lD+1
         lDPOSleap[n-1] = lL?1:0		//modified by mengxw,猫庐掳氓陆聲氓聠聹氓聨聠茅聴掳忙聹聢茂录聦1猫隆篓莽陇潞茅聴掳忙聹聢
      }

      //sYear,sMonth,sDay,week,
      //lYear,lMonth,lDay,isLeap,
      //cYear,cMonth,cDay
      this[i] = new calElement(y, m+1, i+1, nStr1[(i+this.firstWeek)%7],
								lY, lM, lD++, lL,
								cyclical(lDObj.yearCyl) ,cyclical(lDObj.monCyl), cyclical(lDObj.dayCyl++) )

      if((i+this.firstWeek)%7==0)   this[i].color = 'red'  //氓聭篓忙聴楼茅垄聹猫聣虏
      if((i+this.firstWeek)%14==13) this[i].color = 'red'  //氓聭篓盲录聭盲潞聦忙聴楼茅垄聹猫聣虏
   }

   //猫聤聜忙掳聰
   tmp1=sTerm(y,m*2  )-1
   tmp2=sTerm(y,m*2+1)-1
   this[tmp1].solarTerms = solarTerm[m*2]
   this[tmp2].solarTerms = solarTerm[m*2+1]
   if(m==3) this[tmp1].color = 'red' //忙赂聟忙聵聨茅垄聹猫聣虏

   //氓聸陆氓聨聠猫聤聜忙聴楼
   for(i in sFtv)
      if(sFtv[i].match(/^(\d{2})(\d{2})([\s\*])(.+)$/))
         if(Number(RegExp.$1)==(m+1)) {
            this[Number(RegExp.$2)-1].solarFestival += RegExp.$4 + ' '
            if(RegExp.$3=='*') this[Number(RegExp.$2)-1].color = 'red'
         }

   //忙聹聢氓聭篓猫聤聜忙聴楼
   for(i in wFtv)
      if(wFtv[i].match(/^(\d{2})(\d)(\d)([\s\*])(.+)$/))
         if(Number(RegExp.$1)==(m+1)) {
            tmp1=Number(RegExp.$2)
            tmp2=Number(RegExp.$3)
            this[((this.firstWeek>tmp2)?7:0) + 7*(tmp1-1) + tmp2 - this.firstWeek].solarFestival += RegExp.$5 + ' '
         }

   //氓聠聹氓聨聠猫聤聜忙聴楼
   for(i in lFtv)
      if(lFtv[i].match(/^(\d{2})(.{2})([\s\*])(.+)$/)) {
         tmp1=Number(RegExp.$1)-firstLM
         /*if(tmp1==-11) tmp1=1
         if(tmp1 >=0 && tmp1<n) {
            tmp2 = lDPOS[tmp1] + Number(RegExp.$2) -1
            if( tmp2 >= 0 && tmp2<this.length) {
               this[tmp2].lunarFestival += RegExp.$4 + ' '
               if(RegExp.$3=='*') this[tmp2].color = 'red'
            }
         }*/
         if(tmp1<=-11) tmp1=tmp1+12 //modified by mengxw,begin
         if((lDPOSleap[1]==0&&lDPOSleap[2]==0)||( tmp1==0 && lDPOSleap[1]==1 )||(tmp1<=1&& lDPOSleap[2]==1)) {
            tmp2 = lDPOS[tmp1] + Number(RegExp.$2) -1
            if( tmp2 >= 0 && tmp2<this.length) {
               this[tmp2].lunarFestival += RegExp.$4 + ' '
               if(RegExp.$3=='*') this[tmp2].color = 'red'
            }
            }
            if (lDPOSleap[1]==1 && tmp1<n-1 && tmp1>=0) {
            tmp2 = lDPOS[tmp1+1] + Number(RegExp.$2) -1
            if( tmp2 >= 0 && tmp2<this.length) {
               this[tmp2].lunarFestival += RegExp.$4 + ' '
               if(RegExp.$3=='*') this[tmp2].color = 'red'
            }
            }
            if (lDPOSleap[2]==1 && tmp1==1) {
            tmp2 = lDPOS[tmp1+1] + Number(RegExp.$2) -1
            if( tmp2 >= 0 && tmp2<this.length) {
               this[tmp2].lunarFestival += RegExp.$4 + ' '
               if(RegExp.$3=='*') this[tmp2].color = 'red'
            }
         }//modified by mengxw,end 氓陇聞莽聬聠氓聠聹氓聨聠茅聴掳忙聹聢
      }

   //茅禄聭猫聣虏忙聵聼忙聹聼盲潞聰
   if((this.firstWeek+12)%7==5)
      this[12].solarFestival += '茅禄聭猫聣虏忙聵聼忙聹聼盲潞聰 '

   //盲禄聤忙聴楼
   if(y==tY && m==tM) this[tD-1].isToday = true;

}

//====================== 盲赂颅忙聳聡忙聴楼忙聹聼
function cDay(d){
   var s;

   switch (d) {
      case 10:
         s = '氓聢聺氓聧聛'; break;
      case 20:
         s = '盲潞聦氓聧聛'; break;
         break;
      case 30:
         s = '盲赂聣氓聧聛'; break;
         break;
      default :
         s = nStr2[Math.floor(d/10)];
         s += nStr1[d%10];
   }
   return(s);
}

///////////////////////////////////////////////////////////////////////////////

var cld;

function drawCld(SY,SM) {
   var i,sD,s,size;
   cld = new calendar(SY,SM);

   if(SY>1874 && SY<1909) yDisplay = '盲陆聸氓聨聠' + (((SY-1874)==1)?'氓聟聝':SY+544)
   if(SY>1908 && SY<1912) yDisplay = '盲陆聸氓聨聠' + (((SY-1908)==1)?'氓聟聝':SY+544)
   if(SY>1911) yDisplay = '盲陆聸氓聨聠' + (((SY+544)==1)?'氓聟聝':SY+544)

   GZ.innerHTML = yDisplay +'氓鹿麓 氓聠聹氓聨聠氓虏聛忙卢隆' + cyclical(SY-1900+36) + '氓鹿麓 &nbsp;&nbsp;茫聙聬'+Animals[(SY-4)%12]+'茫聙聭';

   YMBG.innerHTML = "&nbsp;" + SY + "<BR>&nbsp;" + monthName[SM];

   for(i=0;i<42;i++) {

      sObj=eval('SD'+ i);
      lObj=eval('LD'+ i);

      sObj.className = '';

      sD = i - cld.firstWeek;

      if(sD>-1 && sD<cld.length) { //忙聴楼忙聹聼氓聠聟
         sObj.innerHTML = sD+1;

         if(cld[sD].isToday) sObj.className = 'todyaColor'; //盲禄聤忙聴楼茅垄聹猫聣虏

         sObj.style.color = cld[sD].color; //氓聸陆氓庐職氓聛聡忙聴楼茅垄聹猫聣虏

         if(cld[sD].lDay==1) //忙聵戮莽陇潞氓聠聹氓聨聠忙聹聢
//            lObj.innerHTML = '<b>'+(cld[sD].isLeap?'茅聴掳':'') + cld[sD].lMonth + '忙聹聢' + (monthDays(cld[sD].lYear,cld[sD].lMonth)==29?'氓掳聫':'氓陇搂')+'</b>';
            lObj.innerHTML = '<b>'+(cld[sD].isLeap?'茅聴掳':'') + nStr3[cld[sD].lMonth] + '忙聹聢' + ((cld[sD].isLeap?leapDays(cld[sD].lYear):monthDays(cld[sD].lYear,cld[sD].lMonth))==29?'氓掳聫':'氓陇搂')+'</b>'; //茅聡聥忙聟搂氓聣聸 - 莽聰篓忙录垄氓颅聴忙聲赂氓颅聴茅隆炉莽陇潞猫戮虏忙颅路忙聹聢盲禄陆盲赂娄忙聸麓忙颅拢茅聳聫忙聹聢氓陇搂氓掳聫茅隆炉莽陇潞茅聦炉猫陋陇
         else //忙聵戮莽陇潞氓聠聹氓聨聠忙聴楼
            lObj.innerHTML = cDay(cld[sD].lDay);

         s=cld[sD].lunarFestival;
         if(s.length>0) { //氓聠聹氓聨聠猫聤聜忙聴楼
            if(s.length>6) s = s.substr(0, 4)+'芒聙娄';
            s = s.fontcolor('red');
         }
         else { //氓聸陆氓聨聠猫聤聜忙聴楼
            s=cld[sD].solarFestival;
            if(s.length>0) {
               size = (s.charCodeAt(0)>0 && s.charCodeAt(0)<128)?8:4;
               if(s.length>size+2) s = s.substr(0, size)+'芒聙娄';
               s = s.fontcolor('blue');
            }
            else { //氓禄驴氓聸聸猫聤聜忙掳聰
               s=cld[sD].solarTerms;
               if(s.length>0) s = s.fontcolor('limegreen');
            }
         }
         if(s.length>0) lObj.innerHTML = s;

      }
      else { //茅聺聻忙聴楼忙聹聼
         sObj.innerHTML = '';
         lObj.innerHTML = '';
      }
   }
}

function changeCld() {
   var y,m;
   y=CLD.SY.selectedIndex+1900;
   m=CLD.SM.selectedIndex;
   drawCld(y,m);
}

function pushBtm(K) {
   switch (K){
      case 'YU' :
         if(CLD.SY.selectedIndex>0) CLD.SY.selectedIndex--;
         break;
      case 'YD' :
         if(CLD.SY.selectedIndex<149) CLD.SY.selectedIndex++;
         break;
      case 'MU' :
         if(CLD.SM.selectedIndex>0) {
            CLD.SM.selectedIndex--;
         }
         else {
            CLD.SM.selectedIndex=11;
            if(CLD.SY.selectedIndex>0) CLD.SY.selectedIndex--;
         }
         break;
      case 'MD' :
         if(CLD.SM.selectedIndex<11) {
            CLD.SM.selectedIndex++;
         }
         else {
            CLD.SM.selectedIndex=0;
            if(CLD.SY.selectedIndex<149) CLD.SY.selectedIndex++;
         }
         break;
      default :
         CLD.SY.selectedIndex=tY-1900;
         CLD.SM.selectedIndex=tM;
   }
   changeCld();
}

var Today = new Date();
var tY = Today.getFullYear();
var tM = Today.getMonth();
var tD = Today.getDate();

//////////////////////////////////////////////////////////////////////////////

var width = "130";
var offsetx = 2;
var offsety = 16;

var x = 0;
var y = 0;
var snow = 0;
var sw = 0;
var cnt = 0;

var dStyle;
document.onmousemove = mEvn;

//忙聵戮莽陇潞猫炉娄莽禄聠忙聴楼忙聹聼猫碌聞忙聳聶
function mOvr(v) {
   var s,festival;
   var sObj=eval('SD'+ v);
   var d=sObj.innerHTML-1;

      //sYear,sMonth,sDay,week,
      //lYear,lMonth,lDay,isLeap,
      //cYear,cMonth,cDay

   if(sObj.innerHTML!='') {

      sObj.style.cursor = 's-resize';

      if(cld[d].solarTerms == '' && cld[d].solarFestival == '' && cld[d].lunarFestival == '')
         festival = '';
      else
         festival = '<TABLE WIDTH=100% BORDER=0 CELLPADDING=2 CELLSPACING=0 BGCOLOR="#CCFFCC"><TR><TD>'+
         '<FONT COLOR="#000000" STYLE="font-size:9pt;">'+cld[d].solarTerms + ' ' + cld[d].solarFestival + ' ' + cld[d].lunarFestival+'</FONT></TD>'+
         '</TR></TABLE>';

      s= '<TABLE WIDTH="130" BORDER=0 CELLPADDING="2" CELLSPACING=0 BGCOLOR="#000066"><TR><TD>' +
         '<TABLE WIDTH=100% BORDER=0 CELLPADDING=0 CELLSPACING=0><TR><TD ALIGN="right"><FONT COLOR="#ffffff" STYLE="font-size:9pt;">'+
         cld[d].sYear+' 氓鹿麓 '+cld[d].sMonth+' 忙聹聢 '+cld[d].sDay+' 忙聴楼<br>忙聵聼忙聹聼'+cld[d].week+'<br>'+
         '<font color="violet">氓聠聹氓聨聠'+(cld[d].isLeap?'茅聴掳 ':' ')+cld[d].lMonth+' 忙聹聢 '+cld[d].lDay+' 忙聴楼</font><br>'+
         '<font color="yellow">'+cld[d].cYear+'氓鹿麓 '+cld[d].cMonth+'忙聹聢 '+cld[d].cDay + '忙聴楼</font>'+
         '</FONT></TD></TR></TABLE>'+ festival +'</TD></TR></TABLE>';

      document.all["detail"].innerHTML = s;

   	if(snow == 0) {
        dStyle.left = x+offsetx-(width/2);
        dStyle.top = y+offsety;
   		dStyle.visibility = "visible";
   		snow = 1;
   	}
  }
}

//忙赂聟茅聶陇猫炉娄莽禄聠忙聴楼忙聹聼猫碌聞忙聳聶
function mOut() {
	if( cnt >= 1 ) { sw = 0 }
	if( sw == 0 ) { snow = 0;	dStyle.visibility = "hidden";}
	else cnt++;
}

//氓聫聳氓戮聴盲陆聧莽陆庐
function mEvn() {
   x=event.x;
   y=event.y;
   if (document.body.scrollLeft){x=event.x+document.body.scrollLeft; y=event.y+document.body.scrollTop;}
   if (snow) {
      dStyle.left = x+offsetx-(width/2)
      dStyle.top = y+offsety
   }
}

///////////////////////////////////////////////////////////////////////////

function changeTZ() {
   CITY.innerHTML = CLD.TZ.value.substr(6)
   setCookie("TZ",CLD.TZ.selectedIndex)
}

function tick() {
   var today
   today = new Date()
   Clock.innerHTML = today.toLocaleString().replace(/(氓鹿麓|忙聹聢)/g, "/").replace(/忙聴楼/, "");
   Clock.innerHTML = TimeAdd(today.toGMTString(), CLD.TZ.value)  
   window.setTimeout("tick()", 1000);
}

function setCookie(name, value) {
	var today = new Date()
	var expires = new Date()
	expires.setTime(today.getTime() + 1000*60*60*24*365)
	document.cookie = name + "=" + escape(value)	+ "; expires=" + expires.toGMTString()
}

function getCookie(Name) {
   var search = Name + "="
   if(document.cookie.length > 0) {
      offset = document.cookie.indexOf(search)
      if(offset != -1) {
         offset += search.length
         end = document.cookie.indexOf(";", offset)
         if(end == -1) end = document.cookie.length
         return unescape(document.cookie.substring(offset, end))
      }
      else return ""
   }
}

/////////////////////////////////////////////////////////

function initial() {
   dStyle = detail.style;
   CLD.SY.selectedIndex=tY-1900;
   CLD.SM.selectedIndex=tM;
   drawCld(tY,tM);

   CLD.TZ.selectedIndex=getCookie("TZ");
   changeTZ();
   tick();
}
//-->
